%利用差分格法计算燃油压强与密度之间的对应关系，作为以后计算的基础

clear;
A=xlsread('附件3-弹性模量与压力');
P=A(1:201,1);
E=A(1:201,2);
rho= [zeros(1,200),0.85];                                                                    
for i=200:-1:1
    rho(i)=E(i)*rho(i+1)/(P(i+1)-P(i)+E(i));
end
core=[P';rho];                                                             %以100Mpa及其对应密度作为初值计算100-200Mpa对应的密度

P=A(201:401,1);
E=A(201:401,2);
rho= [0.85,zeros(1,200)];                                                                    
for i=2:201
    rho(i)=(rho(i-1)/E(i-1))*(P(i)-P(i-1)+E(i-1));
end
cor=[P';rho];                                                              %以100Mpa及其对应密度作为初值计算0-100Mpa对应的密度


rel=[core,cor(:,2:201)];                                                   %合并
