%计算问题2稳定所需的转速 即变量w

T=xlsread('附件1-凸轮边缘曲线');
M=T(1:263,:);
T=[flip(M);M(2:263,:)];
Z=xlsread('附件2-针阀运动曲线');
S=zeros(246,2);
S(1:45,:)=Z(1:45,1:2);
S(46:201,:)=[(0.45:0.01:2)',2*ones(156,1)];
S(202:246,:)=Z(1:45,4:5);

OUT1=zeros(1,245);
OUT2=zeros(1,245);
out=0;
for i=1:246
    
    s1=S(i,2)*pi*(2.5+S(i,2)*sin(0.157));
    s2=0.49*pi;
    s=s1*s2/(s1^2+s2^2)^0.5;
    dem=0.85*s*(2*(100-0.3)/0.85)^0.5*0.01*0.85;
    out=out+dem;
  OUT1(i)=dem;
  OUT2(i)=out;
       
end
plot(0:0.01:2.45,100*OUT1(1:246)/0.85);


  te=[];
for t=0.1:0.001:1
    L=in(t,T,rel);
    n=314*2*t;
    te=[te,(100/n)*L(1)];
    if (100/n)*L(1)<=out
        break
    end
end
maxp=L(2);
w=0.01/t;
