%计算问题3稳定所需的转速 即变量w

T=xlsread('附件1-凸轮边缘曲线');
M=T(1:263,:);
T=[flip(M);M(2:263,:)];
Z=xlsread('附件2-针阀运动曲线');
S=zeros(246,2);
S(1:45,:)=Z(1:45,1:2);
S(46:201,:)=[(0.45:0.01:2)',2*ones(156,1)];
S(202:246,:)=Z(1:45,4:5);
out=0;
OUT1=zeros(1,246);
OUT2=zeros(1,246); 
for i=1:246
    s1=S(i,2)*pi*(2.5+S(i,2)*sin(0.157));
    s2=0.49*pi;
    s=s1*s2/(s1^2+s2^2)^0.5;
    d=0.85*s*0.85*(99.7*2/0.85)^0.5*0.01;
    out=out+d;
    OUT1(i)=d;
    OUT2(i)=out;
end
    
for t=0.1:0.001:0.4
    L=in(t,T,rel);
    n=314*2*t;
    if (100/n)*L(1)<=2*out
        break
    end
end
 maxp=L(2);  
w=0.01/t;

